spec/support/fixtures/evt_invoice_payment_failed.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "invoice.payment_failed",
  "object": "event",
  "request": null,
  "data": {
    "object": {
      "date": 1394238525,
      "id": "in_00000000000000",
      "period_start": 1394238525,
      "period_end": 1394238525,
      "lines": {
        "data": [
          {
            "id": "sub_3cpHaN25HNjKXf",
            "object": "line_item",
            "type": "subscription",
            "livemode": true,
            "amount": 999,
            "currency": "usd",
            "proration": false,
            "period": {
              "start": 1396921929,
              "end": 1399513929
            },
            "quantity": 1,
            "plan": {
              "interval": "month",
              "name": "MyFlix Subscription",
              "created": 1393868817,
              "amount": 999,
              "currency": "usd",
              "id": "myflix_subscription",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": null,
              "metadata": {
              }
            },
            "description": null,
            "metadata": null
          }
        ],
        "count": 1,
        "object": "list",
        "url": "/v1/invoices/in_103cnw2saBS1OrXtJ8PsmMSN/lines"
      },
      "subtotal": 999,
      "total": 999,
      "customer": "cus_00000000000000",
      "object": "invoice",
      "attempted": true,
      "closed": false,
      "paid": false,
      "livemode": false,
      "attempt_count": 0,
      "amount_due": 999,
      "currency": "usd",
      "starting_balance": 0,
      "ending_balance": 0,
      "next_payment_attempt": null,
      "charge": "ch_00000000000000",
      "discount": null,
      "application_fee": null,
      "subscription": "sub_00000000000000",
      "metadata": {
      },
      "description": null
    }
  }
}